[
    {
        "Id": 1,
        "Course Code ": "SPGE 165",
        "Title": "แอโรบิกเพื่อสุขภาพ",
        "Faculty\/\nInstitution\/College": "วิทยาลัยวิทยาศาสตร์และเทคโนโลยีการกีฬา",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "วิชาเลือกเสรี",
        "Literacy Type": "Health Literacy  (Health, Sport)",
        "Latest Revision of the Course Specifications": "วันที่ 15 มิถุนายน 2565",
        "Course Goals": "นักศึกษามีความรู้ความเข้าใจในการออกกำลังกายด้วยกิจกรรมแอโรบิกเพื่อสุขภาพ และสามารถใช้ประโยชน์จากการออกกำลังกาย เพื่อนันทนาการและพัฒนาสุขภาพองค์รวม",
        "Course Objectives": "๑. นักศึกษามีความรู้ ความเข้าใจเกี่ยวกับกิจกรรมแอโรบิกเพื่อสุขภาพ\n๒. นักศึกษามีทักษะพื้นฐานกิจกรรมแอโรบิกเพื่อสุขภาพที่ถูกต้องและปลอดภัย \n๓. สามารถสืบค้นข้อมูลเกี่ยวกับกิจกรรมแอโรบิกเพื่อสุขภาพโดยใช้เทคโนโลยีสารสนเทศที่ถูกต้องและเชื่อถือได้\n๔. สามารถสื่อสารแลกเปลี่ยนเรียนรู้ข้อมูลสุขภาพเกี่ยวกับกิจกรรมแอโรบิกเพื่อสุขภาพ เช่น รูปแบบ และ วิธีการต่าง ๆ ของกิจกรรมแอโรบิกเพื่อสุขภาพ",
        "Course Description": "การเต้นแอโรบิกแบบมาตรฐาน บุคลิกภาพ การบาดเจ็บและความปลอดภัย ",
        "CurriculumWebsite": "https:\/\/ss.mahidol.ac.th\/th\/index.php\/th\/"
    },
    {
        "Id": 2,
        "Course Code ": "SPGE 166",
        "Title": "เทเบิลเทนนิสเพื่อสุขภาพ",
        "Faculty\/\nInstitution\/College": "วิทยาลัยวิทยาศาสตร์และเทคโนโลยีการกีฬา",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "หมวดวิชาศึกษาทั่วไป",
        "Literacy Type": "Health Literacy  (Health, Sport)",
        "Latest Revision of the Course Specifications": "วันที่ 14 มิถุนายน 2565",
        "Course Goals": "นักศึกษามีความรู้ความเข้าใจในกิจกรรมว่ายน้ำและสามารถใช้ประโยชน์จากเล่นเทเบิลเทนนิสเพื่อนันทนาการและพัฒนาสุขภาพองค์รวม",
        "Course Objectives": "๑. นักศึกษามีความรู้ ความเข้า หลักการ กฎระเบียบ มารยาท ความปลอดภัยและความสำคัญของเล่นเทเบิลเทนนิส เพื่อเชื่อมโยงสุขภาพได้\n๒. นักศึกษามีทักษะพื้นฐานในเล่นเทเบิลเทนนิส ที่ถูกต้องและปลอดภัย \n๓. สามารถสืบค้นข้อมูลเกี่ยวกับการเล่นเทเบิลเทนนิส โดยใช้เทคโนโลยีสารสนเทศที่ถูกต้องและเชื่อถือได้\n๔. สามารถสื่อสารแลกเปลี่ยนเรียนรู้ข้อมูลสุขภาพเกี่ยวกับเล่นเทเบิลเทนนิส เช่น การชมการแข่งขัน การเตรียมตัวก่อนการเล่นเทเบิลเทนนิส",
        "Course Description": "ทักษะการเล่นเทเบิลเทนนิสเพื่อสุขภาพ เทคนิคการแข่งขันประเภทเดี่ยวและคู่ กฎกติกามารยาท การบาดเจ็บและความปลอดภัย การเก็บรักษาอุปกรณ์",
        "CurriculumWebsite": "https:\/\/ss.mahidol.ac.th\/th\/index.php\/th\/"
    },
    {
        "Id": 3,
        "Course Code ": "SPGE 167",
        "Title": "ระบำใต้น้ำเพื่อสุขภาพ",
        "Faculty\/\nInstitution\/College": "วิทยาลัยวิทยาศาสตร์และเทคโนโลยีการกีฬา",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "หมวดวิชาศึกษาทั่วไป และเลือกเสรี",
        "Literacy Type": "Health Literacy  (Health, Sport)",
        "Latest Revision of the Course Specifications": "-",
        "Course Goals": "นักศึกษามีความรู้ความเข้าใจในการออกกำลังกายด้วยกีฬาระบำใต้น้ำ และสามารถใช้ประโยชน์จากการออกกำลังกาย เพื่อนันทนาการและพัฒนาสุขภาพองค์รวม",
        "Course Objectives": "๑. นักศึกษามีความรู้ ความเข้าใจเกี่ยวกับกีฬาระบำใต้น้ำ\n๒. นักศึกษามีทักษะพื้นฐานกีฬาระบำใต้น้ำ ที่ถูกต้องและปลอดภัย \n๓. สามารถสืบค้นข้อมูลเกี่ยวกับกีฬาระบำใต้น้ำ โดยใช้เทคโนโลยีสารสนเทศที่ถูกต้องและเชื่อถือได้\n๔. สามารถสื่อสารแลกเปลี่ยนเรียนรู้ข้อมูลสุขภาพเกี่ยวกับกีฬาระบำใต้น้ำ เช่นการชมการแข่งขัน การเตรียมตัวก่อนการเล่น",
        "Course Description": "ระบำใต้น้ำเพื่อสุขภาพ การเตรียมความพร้อมทางร่างกายและจิตใจของผู้เล่นระบำใต้น้ำ ความปลอดภัย มารยาท การแต่งกาย ทักษะพื้นฐาน ในกีฬาระบำใต้น้ำ เช่น การลอยตัว การดำน้ำ การฝึกการเคลื่อนที่ในทิศทางต่างๆ การฝึกบัลเลต์เลค, ฟลามิงโก  การฝึกเอ๊กบีทเตอร์  ท่าชุดประกอบจังหวะขั้นพื้นฐาน การเล่นประกอบดนตรีประเภททีม ",
        "CurriculumWebsite": "https:\/\/ss.mahidol.ac.th\/th\/index.php\/th\/"
    },
    {
        "Id": 4,
        "Course Code ": "SPGE 168",
        "Title": "เทนนิสเพื่อสุขภาพ",
        "Faculty\/\nInstitution\/College": "วิทยาลัยวิทยาศาสตร์และเทคโนโลยีการกีฬา",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "หมวดวิชาศึกษาทั่วไป และเลือกเสรี",
        "Literacy Type": "Health Literacy  (Health, Sport)",
        "Latest Revision of the Course Specifications": "วันที่ 14 มิถุนายน 2565",
        "Course Goals": "นักศึกษามีความรู้ความเข้าใจในกิจกรรมว่ายน้ำและสามารถใช้ประโยชน์จากเล่นเทนนิสเพื่อนันทนาการและพัฒนาสุขภาพองค์รวม",
        "Course Objectives": "๑. นักศึกษามีความรู้ ความเข้า หลักการ กฎระเบียบ มารยาท ความปลอดภัยและความสำคัญของเล่นเทนนิส เพื่อเชื่อมโยงสุขภาพได้\n๒. นักศึกษามีทักษะพื้นฐานในเล่นเทนนิส ที่ถูกต้องและปลอดภัย \n๓. สามารถสืบค้นข้อมูลเกี่ยวกับการเล่นเทนนิส โดยใช้เทคโนโลยีสารสนเทศที่ถูกต้องและเชื่อถือได้\n๔. สามารถสื่อสารแลกเปลี่ยนเรียนรู้ข้อมูลสุขภาพเกี่ยวกับเล่นเทนนิส เช่น การชมการแข่งขัน การเตรียมตัวก่อนการเล่นเทนนิส",
        "Course Description": "ทักษะพื้นฐานในการเล่นเทนนิสเพื่อสุขภาพ เทคนิคการแข่งขันประเภทเดี่ยวและคู่ กฎกติกามารยาท การบาดเจ็บและความปลอดภัย การเก็บรักษาอุปกรณ์",
        "CurriculumWebsite": "https:\/\/ss.mahidol.ac.th\/th\/index.php\/th\/"
    },
    {
        "Id": 5,
        "Course Code ": "SPGE 169",
        "Title": "บาสเกตบอลเพื่อสุขภาพ",
        "Faculty\/\nInstitution\/College": "วิทยาลัยวิทยาศาสตร์และเทคโนโลยีการกีฬา",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "หมวดวิชาศึกษาทั่วไป และเลือกเสรี",
        "Literacy Type": "Health Literacy  (Health, Sport)",
        "Latest Revision of the Course Specifications": "วันที่ 15 มิถุนายน 2565",
        "Course Goals": "นักศึกษามีความรู้ความเข้าใจในกิจกรรมว่ายน้ำและสามารถใช้ประโยชน์จากเล่นบาสเกตบอลเพื่อนันทนาการและพัฒนาสุขภาพองค์รวม",
        "Course Objectives": "๑. นักศึกษามีความรู้ ความเข้า หลักการ กฎระเบียบ มารยาท ความปลอดภัยและความสำคัญของเล่นบาสเกตบอล เพื่อเชื่อมโยงสุขภาพได้\n๒. นักศึกษามีทักษะพื้นฐานในเล่นบาสเกตบอล ที่ถูกต้องและปลอดภัย \n๓. สามารถสืบค้นข้อมูลเกี่ยวกับการเล่นบาสเกตบอล โดยใช้เทคโนโลยีสารสนเทศที่ถูกต้องและเชื่อถือได้\n๔. สามารถสื่อสารแลกเปลี่ยนเรียนรู้ข้อมูลสุขภาพเกี่ยวกับเล่นบาสเกตบอล เช่น การชมการแข่งขัน การเตรียมตัวก่อนการเล่นบาสเกตบอล",
        "Course Description": "กฎกติกา ในการแข่งขันกีฬาบาสเกตบอลสากล ประวัติความเป็นมา ประโยชน์ ทักษะพื้นฐานในการเล่นบาสเกตบอลเพื่อสุขภาพ ได้แก่ การรับ-ส่งลูกบาสเกตบอล การเลี้ยงลูกบาสเกตบอล การยิงประตูทำคะแนนในกีฬาบาสเกตบอล การเล่นทีมตามกฎกติกาและมารยาท สามารถเล่นกีฬาบาสเกตบอลร่วมกับผู้อื่นได้อย่างปลอดภัย สามารถใช้กีฬาบาสเกตบอลเป็นสื่อในการออกกำลังกายและสร้างสรรค์กิจกรรมนันทนาการส่งเสริมสุขภาพได้ ",
        "CurriculumWebsite": "https:\/\/ss.mahidol.ac.th\/th\/index.php\/th\/"
    },
    {
        "Id": 6,
        "Course Code ": "SPGE 170",
        "Title": "จักรยานเพื่อสุขภาพ",
        "Faculty\/\nInstitution\/College": "วิทยาลัยวิทยาศาสตร์และเทคโนโลยีการกีฬา",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "หมวดวิชาศึกษาทั่วไป และเลือกเสรี",
        "Literacy Type": "Health Literacy  (Health, Sport)",
        "Latest Revision of the Course Specifications": "-",
        "Course Goals": "นักศึกษามีความรู้ความเข้าใจในกิจกรรมจักรยานเพื่อสุขภาพ และสามารถใช้ประโยชน์จากการเล่นกิจกรรมจักรยานเพื่อสุขภาพ เพื่อนันทนาการและพัฒนาสุขภาพองค์รวม",
        "Course Objectives": "๑. นักศึกษามีความรู้ ความเข้าใจเกี่ยวกับกิจกรรมจักรยานเพื่อสุขภาพ\n๒. นักศึกษามีทักษะพื้นฐานกิจกรรมจักรยานเพื่อสุขภาพที่ถูกต้องและปลอดภัย \n๓. สามารถสืบค้นข้อมูลเกี่ยวกับกิจกรรมจักรยานเพื่อสุขภาพ โดยใช้เทคโนโลยีสารสนเทศที่ถูกต้องและเชื่อถือได้\n๔.  สามารถสื่อสารแลกเปลี่ยนเรียนรู้ข้อมูลสุขภาพเกี่ยวกับกิจกรรมลีลาศเพื่อสุขภาพ เช่น รูปแบบ และ วิธีการต่าง ๆ ของกิจกรรมจักรยานเพื่อสุขภาพ",
        "Course Description": "วิธีการปั่นจักรยานที่ถูกต้อง   การเตรียมความพร้อมทางร่างกายและจิตใจของนักปั่นจักรยาน การดูแลรักษาจักรยานและอุปกรณ์ ประโยชน์ หลักการพื้นฐาน  ทักษะการขี่จักรยาน ความปลอดภัย กฎ กติกา มารยาทในการปั่นจักรยาน ระเบียบปฏิบัติในการใช้เส้นทางจักรยานเพื่อการท่องเที่ยวและนันทนาการรอบมหาวิทยาลัย",
        "CurriculumWebsite": "https:\/\/ss.mahidol.ac.th\/th\/index.php\/th\/"
    },
    {
        "Id": 7,
        "Course Code ": "SPGE 171",
        "Title": "ฟุตบอลเพื่อสุขภาพ",
        "Faculty\/\nInstitution\/College": "วิทยาลัยวิทยาศาสตร์และเทคโนโลยีการกีฬา",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "หมวดวิชาศึกษาทั่วไป",
        "Literacy Type": "Health Literacy  (Health, Sport)",
        "Latest Revision of the Course Specifications": "วันที่  ๑  กุมภาพันธ์  พ.ศ. ๒๕๖๒   ",
        "Course Goals": "นักศึกษามีความรู้ความเข้าใจในกีฬาฟุตบอล และสามารถใช้ประโยชน์จากการเล่นกีฬาฟุตบอล เพื่อนันทนาการและพัฒนาสุขภาพองค์รวม",
        "Course Objectives": "๑. นักศึกษามีความรู้ ความเข้าใจเกี่ยวกับกีฬาฟุตบอล\n๒. นักศึกษามีทักษะพื้นฐานกีฬาฟุตบอล ที่ถูกต้องและปลอดภัย \n๓. สามารถสืบค้นข้อมูลเกี่ยวกับกีฬาฟุตบอล โดยใช้เทคโนโลยีสารสนเทศที่ถูกต้องและเชื่อถือได้\n๔. สามารถสื่อสารแลกเปลี่ยนเรียนรู้ข้อมูลสุขภาพเกี่ยวกับกีฬาฟุตบอล เช่นการชมการแข่งขัน การเตรียมตัวก่อนการเล่น",
        "Course Description": "ประวัติและความเป็นมาของกีฬาฟุตบอล กฎกติกาการแข่งขัน การแต่งกายและอุปกรณ์ ตำแหน่งผู้เล่น สมรรถภาพทางกายที่สำคัญต่อนักฟุตบอล ทักษะพื้นฐานในการเล่นฟุตบอล เช่น การจับบอล-การส่ง การเลี้ยง การยิงประตู ทักษะของผู้รักษาประตู รูปแบบการเล่นเป็นทีม เช่น รูปแบบการเล่นเกมส์การรุก(โจมตี) รูปแบบการเล่นเกมส์การรับ(การป้องกัน) การเล่นลูกเตะมุม การเล่นลูกฟรีคิก การเตะลูกโทษ รูปแบบการเล่นที่ทันสมัย มารยาทในการเล่น การป้องกันการบาดเจ็บและความปลอดภัยในการเล่นฟุตบอล",
        "CurriculumWebsite": "https:\/\/ss.mahidol.ac.th\/th\/index.php\/th\/"
    },
    {
        "Id": 8,
        "Course Code ": "SPGE 172",
        "Title": "เปตองเพื่อสุขภาพ",
        "Faculty\/\nInstitution\/College": "วิทยาลัยวิทยาศาสตร์และเทคโนโลยีการกีฬา",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "หมวดวิชาศึกษาทั่วไป และเลือกเสรี",
        "Literacy Type": "Health Literacy  (Health, Sport)",
        "Latest Revision of the Course Specifications": "วันที่ 14 มิถุนายน 2565",
        "Course Goals": "นักศึกษามีความรู้ความเข้าใจในกีฬาเปตอง และสามารถใช้ประโยชน์จากการเล่นกีฬาเปตอง เพื่อนันทนาการและพัฒนาสุขภาพองค์รวม",
        "Course Objectives": "๑. นักศึกษามีความรู้ ความเข้าใจเกี่ยวกับกีฬาเปตอง\n๒. นักศึกษามีทักษะพื้นฐานของกีฬาเปตอง ที่ถูกต้องและปลอดภัย \n๓. สามารถสืบค้นข้อมูลเกี่ยวกับกีฬาเปตอง โดยใช้เทคโนโลยีสารสนเทศที่ถูกต้องและเชื่อถือได้\n๔. สามารถสื่อสารแลกเปลี่ยนเรียนรู้ข้อมูลสุขภาพเกี่ยวกับกีฬาเปตอง เช่นการชมการแข่งขัน การเตรียมตัวก่อนการเล่น การเลือกประเภทในการเล่นทีม",
        "Course Description": "ทักษะการเล่นกีฬาเปตองเพื่อสุขภาพ  การแข่งเดี่ยว การแข่งทีม กฎกติกามารยาท การบาดเจ็บและความปลอดภัย การเก็บรักษาอุปกรณ์ ",
        "CurriculumWebsite": "https:\/\/ss.mahidol.ac.th\/th\/index.php\/th\/"
    },
    {
        "Id": 9,
        "Course Code ": "SPGE 173",
        "Title": "กายและจิตเพื่อสุขภาพ",
        "Faculty\/\nInstitution\/College": "วิทยาลัยวิทยาศาสตร์และเทคโนโลยีการกีฬา",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "วิชาเลือกเสรี",
        "Literacy Type": "Health Literacy  (Health, Sport)",
        "Latest Revision of the Course Specifications": "วันที่ 15 มิถุนายน 2565",
        "Course Goals": "นักศึกษามีความรู้ความเข้าใจในการออกกำลังกายด้วยกิจกรรมกายและจิตเพื่อสุขภาพและสามารถใช้ประโยชน์จากการออกกำลังกาย เพื่อนันทนาการและพัฒนาสุขภาพองค์รวม",
        "Course Objectives": "๑. นักศึกษามีความรู้ ความเข้าใจเกี่ยวกับกิจกรรมกายและจิตเพื่อสุขภาพ\n๒. นักศึกษามีทักษะพื้นฐานกิจกรรมกายและจิตเพื่อสุขภาพเพื่อสุขภาพที่ถูกต้องและปลอดภัย \n๓. สามารถสืบค้นข้อมูลเกี่ยวกับกิจกรรมกายและจิตเพื่อสุขภาพโดยใช้เทคโนโลยีสารสนเทศที่ถูกต้องและเชื่อถือได้\n๔. สามารถสื่อสารแลกเปลี่ยนเรียนรู้ข้อมูลสุขภาพเกี่ยวกับกิจกรรมกายและจิตเพื่อสุขภาพเช่น รูปแบบ และวิธีการต่าง ๆ ของกิจกรรมกายและจิตเพื่อสุขภาพ",
        "Course Description": "กายและจิตเพื่อสุขภาพ ทักษะพื้นฐานการเคลื่อนไหว การออกกำลังกายในรูปแบบส่งเสริมพัฒนาร่างกายและจิตใจ ด้วยท่ากายบริหาร โยคะ รำมวยจีน ฟิลาเต้  และ การควบคุมการหายใจ  ",
        "CurriculumWebsite": "https:\/\/ss.mahidol.ac.th\/th\/index.php\/th\/"
    },
    {
        "Id": 10,
        "Course Code ": "SPGE 174",
        "Title": "กีฬากับการท่องเที่ยว",
        "Faculty\/\nInstitution\/College": "วิทยาลัยวิทยาศาสตร์และเทคโนโลยีการกีฬา",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "หมวดวิชาศึกษาทั่วไป และเลือกเสรี",
        "Literacy Type": "Health Literacy  (Health, Sport)",
        "Latest Revision of the Course Specifications": "วันที่ 15 มิถุนายน 2565",
        "Course Goals": "นักศึกษามีความรู้ความเข้าใจปรัชญา แนวคิด คุณค่า และความสัมพันธ์เรื่องกิจกรรมกีฬาและการออกกำลังกาย กิจกรรมกลางแจ้ง และการท่องเที่ยวเพื่อนันทนาการ การพัฒนาสุขภาพองค์รวม และการเรียนรู้ตลอดชีวิต",
        "Course Objectives": "๑. มีความรู้ความเข้าใจเรื่องแนวคิด ปรัชญา และความสัมพันธ์ของกิจกรรมกีฬาและการออกกำลังกาย กิจกรรมกลางแจ้ง และการท่องเที่ยวเพื่อนันทนาการ การพัฒนาสุขภาพองค์รวม และการเรียนรู้ตลอดชีวิต\n๒. มีความรู้ความเข้าใจและทักษะพื้นฐานเรื่องการปฏิบัติตัวเพื่อร่วมกิจกรรมกีฬาและการออกกำลังกาย กิจกรรมกลางแจ้ง และการท่องเที่ยวได้ถูกต้อง เหมาะสม และปลอดภัย \n๓. สืบค้นข้อมูลเรื่องกิจกรรมกีฬาและการออกกำลังกาย กิจกรรมกลางแจ้ง และการท่องเที่ยวโดยใช้เทคโนโลยีสารสนเทศอย่างถูกต้องเหมาะสม\n๔. สื่อสารและแลกเปลี่ยนเรียนรู้ข้อมูลเรื่องกิจกรรมกีฬาและการออกกำลังกาย กิจกรรมกลางแจ้ง และการท่องเที่ยวเพื่อนันทนาการ การพัฒนาสุขภาพองค์รวม และการเรียนรู้ตลอดชีวิต",
        "Course Description": "ปรัชญา แนวคิด คุณค่า และความสัมพันธ์เรื่องกิจกรรมกีฬาและการออกกำลังกาย กิจกรรมกลางแจ้ง                 และการท่องเที่ยวเพื่อนันทนาการ การพัฒนาสุขภาพองค์รวม และการเรียนรู้ตลอดชีวิต",
        "CurriculumWebsite": "https:\/\/ss.mahidol.ac.th\/th\/index.php\/th\/"
    },
    {
        "Id": 11,
        "Course Code ": "SPGE 175",
        "Title": "สุขภาพกระบวนทัศน์ใหม่",
        "Faculty\/\nInstitution\/College": "วิทยาลัยวิทยาศาสตร์และเทคโนโลยีการกีฬา",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "หมวดวิชาศึกษาทั่วไป",
        "Literacy Type": "Health Literacy  (Health, Sport)",
        "Latest Revision of the Course Specifications": "วันที่ ๘ พฤศจิกายน พ.ศ. ๒๕๖๓",
        "Course Goals": "นักศึกษามีความรู้ความเข้าใจเรื่องสุขภาพองค์รวม และสามารถนำไปใช้เพื่อคุณประโยชน์ต่อตนเองและผู้อื่น ",
        "Course Objectives": "๑. เข้าใจแนวคิดเรื่องสุขภาพองค์รวมและประเด็นสุขภาพร่วมสมัย \n๒. แยกแยะ ประเมิน และเลือกข้อมูลเรื่องสุขภาพองค์รวมเพื่อนำไปประยุกต์ได้อย่างเหมาะสม\n๓. สื่อสารและแลกเปลี่ยนเรียนรู้ความรู้สึกและความคิดเห็นเรื่องสุขภาพองค์รวมกับผู้อื่น",
        "Course Description": "แนวคิด หลักการ คุณค่า ความสัมพันธ์เชื่อมโยง และการประยุกต์สุขภาพกระบวนทัศน์ใหม่ ได้แก่                            มิติด้านกายและสิ่งแวดล้อม มิติด้านจิตใจ มิติด้านสังคมและความสัมพันธ์ และมิติด้านปัญญาและการตื่นรู้                           กับสถานการณ์ในชีวิตประจำวันและสังคมที่แตกต่างหลากหลาย เรียนรู้ผ่านประสบการณ์ตรงกระบวนการเรียนรู้                   สู่การเปลี่ยนแปลง และหรือการเรียนรู้ภาคสนาม",
        "CurriculumWebsite": "https:\/\/ss.mahidol.ac.th\/th\/index.php\/th\/"
    },
    {
        "Id": 12,
        "Course Code ": "SPGE 177",
        "Title": "พันธุศาสตร์กับสุขภาพและกิจกรรมทางกาย",
        "Faculty\/\nInstitution\/College": "วิทยาลัยวิทยาศาสตร์และเทคโนโลยีการกีฬา",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "หมวดวิชาศึกษาทั่วไป และเลือกเสรี",
        "Literacy Type": "Health Literacy  (Health, Sport)",
        "Latest Revision of the Course Specifications": "วันที่ ๕ มิถุนายน พ.ศ. ๒๕๖๕   ",
        "Course Goals": "พัฒนานักศึกษาให้มีความรู้ความเข้าใจหลักพันธุศาสตร์เบื้องต้นและความสัมพันธ์ของพันธุกรรมกับการออกกำลังกายรวมถึงการสร้างเสริมสุขภาพโดยใช้พันธุ์กรรมเป็นตัวชี้วัดสุขภาพทางกายเพื่อนำไปใช้ประโยชน์ต่อตนเองและสื่อสารต่อผู้อื่นได้",
        "Course Objectives": "๑. มีความรู้ความเข้าใจเกี่ยวกับหลักการ แนวคิด และความสำคัญของพันธุศาสตร์ต่อการดำเนินชีวิต ของมนุษย์\n๒. เชื่อมโยงความรู้พันธุศาสตร์ ชีววิทยาศาตร์ และโมเลกุลกับการออกกำลังกายและการสร้างเสริมสุขภาพแง่มุมและรูปแบบต่างๆ ตามบริบทที่หลากหลาย\n๓. มีทักษะการสืบค้น ประเมิน ประยุกต์และวิเคราะห์ข้อมูลการออกกำลังกายทั้งด้านบวกและลบที่มีผลต่อพันธุกรรมและชีวโมเลกุล\n๔. มีทักษะทางการสื่อสารเชิงวิชาการประยุกต์ในความสัมพันธ์ระหว่างการออกกำลังกายกับพันธุ์ศาตร์รวมถึงการดำเนินชีวิต",
        "Course Description": "พื้นฐานความรู้พันธุศาสตร์  ชีววิทยาศาสตร์และโมเลกุลเบื้องต้น  บทบาทและความสำคัญของ การออกกำลังกายที่มีผลต่อการเปลี่ยนแปลงพันธุกรรม",
        "CurriculumWebsite": "https:\/\/ss.mahidol.ac.th\/th\/index.php\/th\/"
    },
    {
        "Id": 13,
        "Course Code ": "SHHU 160",
        "Title": "พระพุทธศาสนากับการรักษาโรค",
        "Faculty\/\nInstitution\/College": "คณะสังคมศาสตร์และมนุษยศาสตร์",
        "Curriculum": "หลักสูตรระดับปริญญาตรี ปกติ  (ยกเว้นหลักสูตรนานาชาติ)",
        "CourseType": "วิชาหมวดวิชาศึกษาทั่วไป และกลุ่มวิชาสังคมศาสตร์และมนุษยศาสตร์  ",
        "Literacy Type": "Health Literacy  (Health, Sport)",
        "Latest Revision of the Course Specifications": 241934,
        "Course Goals": "        ๑.๑ เพื่อให้นักศึกษารู้แนวคิดของพระพุทธศาสนาและหลักการของการรักษาโรคตามแนวทางพระพุทธศาสนา\n        ๑.๒ เพื่อให้นักศึกษานำหลักการรักษาโรคตามแนวพระพุทธศาสนาไปประยุกต์ใช้เพื่อประโยชน์แก่ตนเองและสังคม",
        "Course Objectives": "๒.๑.๑ เข้าใจทฤษฎีว่าด้วยการรักษาโรคตามแนวพระพุทธศาสนาด้วยตนเอง\n\t๒.๑.๒ ปฏิบัติได้ด้วยตนเองและวางแผนสาธิต\/แนะนำผู้อื่นให้รู้จักป้องกันโรคตามแนวพระพุทธศาสนาได้\n\t๒.๑.๓ ใช้ความรู้เรื่องการรักษาโรคตามแนวคิดของพระพุทธศาสนาไปช่วยเหลือสังคมได้",
        "Course Description": "แนวคิดเรื่องการรักษาโรคตามนัยพระพุทธศาสนาแบบองค์รวมที่ปรากฎในคัมภีร์พระไตรปิฎกและคัมภีร์อื่นๆ ชั้นหลัง ความสัมพันธ์ระหว่างกายและใจ สาเหตุของโรคทางกายและทางใจ การรักษาโรคด้วยวิธีเจริญสติผ่านการสวดมนต์ เจริญสมาธิและวิปัสสนา วิธีปฏิบัติตนทางกายและใจเพื่อป้องกันและรักษาโรค รวมทั้งการเอาชนะความตายตามพุทธวิธี ",
        "CurriculumWebsite": "https:\/\/sh.mahidol.ac.th\/?page_id=2176"
    },
    {
        "Id": 14,
        "Course Code ": "SHHU 174",
        "Title": "ศาสนากับการรักษาโรค",
        "Faculty\/\nInstitution\/College": "คณะสังคมศาสตร์และมนุษยศาสตร์",
        "Curriculum": "หลักสูตรระดับปริญญาตรี ปกติ  (ยกเว้นหลักสูตรนานาชาติ)",
        "CourseType": "หมวดวิชาศึกษาทั่วไป",
        "Literacy Type": "Social and Humanity Literacy  (Social, Humanity, Law, Ethics, Arts)",
        "Latest Revision of the Course Specifications": "วันที่ ๒๐ เดือนกุมภาพันธ์  พ.ศ. ๒๕๖๒",
        "Course Goals": "นักศึกษามีความรู้ความเข้าใจและสามารถนำความรู้เกี่ยวกับแนวคิดและคำสอนในศาสนาพุทธ คริสต์ และอิสลามไปใช้วิเคราะห์เกี่ยวกับชีวิต สุขภาพ ความเจ็บป่วย และความตาย หลักคำสอนและการปฏิบัติตามหลักศาสนาที่เป็นประโยชน์ต่อการดูแลสุขภาพ การรับมือความเจ็บป่วย การรักษาโรค การดูแลผู้ป่วยและการเตรียมรับความตายได้อย่างถูกต้องตามบริบทของศาสนาและชุมชน โดยคำนึงถึงจริยธรรมและตอบสนองต่อประเด็นทางสังคม",
        "Course Objectives": "๒.๑.๑ มีความรู้ความเข้าใจเรื่อง\n•\tบทบาทของศาสนาในการรักษาโรค \n•\tทัศนะของศาสนาพุทธ ศาสนาคริสต์ และศาสนาอิสลามเกี่ยวกับสุขภาพ ชีวิต โรคภัย ความเจ็บป่วยและความตาย \n•\tคำสอนและการปฏิบัติทางศาสนาพุทธ ศาสนาคริสต์ และศาสนาอิสลามที่เป็นประโยชน์ต่อการดูแลสุขภาพ การรับมือความเจ็บป่วย การรักษาโรค การดูแลผู้ป่วยและการเตรียมรับความตาย\n๒.๑.๒ ระบุ วิพากษ์ และประเมินความสมเหตุสมผลของการอ้างเหตุผลได้\n๒.๑.๓ เรียนรู้กลยุทธ์และทักษะของสาขาวิชาและนำมาปรับใช้กับปัญหาหรือสถานการณ์ใหม่\n๒.๑.๔ ประพฤติตนตามหน้าที่ต่อผู้อื่น กฎหมาย กฎระเบียบ และคุณค่า โดยไม่ต้องมีใครบังคับ\n๒.๑.๕ ใช้เครื่องมือและเทคโนโลยีอันหลากหลายเพื่อสื่อสารอย่างมีประสิทธิภาพและเป้าหมาย เช่น การแบ่งปันข้อมูลความรู้ การแสดงความเห็น การสาธิตหรือร้างสรรค์ผลิตภัณฑ์\n๒.๑.๖ สามารถทำงานร่วมกันอย่างมีประสิทธิภาพในกลุ่มหรือทีม เพื่อให้บรรลุเป้าหมายในเวลาที่กำหนด",
        "Course Description": "              บทบาทของศาสนาในการรักษาโรค ทัศนะของศาสนาพุทธ ศาสนาคริสต์ และศาสนาอิสลามเกี่ยวกับสุขภาพ ชีวิต โรคภัย ความเจ็บป่วยและความตาย คำสอนและการปฏิบัติทางศาสนาพุทธ ศาสนาคริสต์ และศาสนาอิสลามที่เป็นประโยชน์ต่อการดูแลสุขภาพ การรับมือความเจ็บป่วย การรักษาโรค การดูแลผู้ป่วยและการเตรียมรับความตาย ",
        "CurriculumWebsite": "https:\/\/sh.mahidol.ac.th\/?page_id=2176"
    },
    {
        "Id": 15,
        "Course Code ": "SHHU 179",
        "Title": "สมาธิเพื่อการพัฒนาชีวิต",
        "Faculty\/\nInstitution\/College": "คณะสังคมศาสตร์และมนุษยศาสตร์",
        "Curriculum": "หลักสูตรระดับปริญญาตรี ปกติ  (ยกเว้นหลักสูตรนานาชาติ)",
        "CourseType": "หมวดวิชาศึกษาทั่วไป",
        "Literacy Type": "Health Literacy  (Health, Sport)",
        "Latest Revision of the Course Specifications": 241934,
        "Course Goals": "        ๑. ๑ เพื่อให้นักศึกษารู้จักหลักการของสมาธิ ฌาน ญาณและวิปัสสนา \n        ๑. ๒ เพื่อให้นักศึกษาฝึกสมาธิเบื้องต้นเป็น นำหลักการสมาธิไปปฏิบัติเพื่อฝึกสติให้มากขึ้นได้ \n        ๑.๓ เพื่อให้นักศึกษานำหลักการสมาธิ ฌาน ญาณและวิปัสสนาไปแนะนำได้\n        ๑.๔ เพื่อให้นักศึกษานำหลักการของการฝึกสมาธิไปปฏิสัมพันธ์อย่างสร้างสรรค์กับคนอื่นได้ ",
        "Course Objectives": "๒.๑.๑ อธิบายทฤษฎีในการพัฒนาสมาธิ ญาณและปัญญาระดับต่างๆ อย่างละเอียดจนสามารถฝึกปฏิบัติ\n\t         เพื่อควบคุมสติได้อย่างมีประสิทธิภาพด้วยตนเอง\n\t๒.๑.๒ สามารถวางแผนแนะนำผู้อื่นให้รู้จักพัฒนาสมาธิ ฌาน ญาณและปัญญาได้\n\t๒.๑.๓ สามารถเอาความรู้เรื่องสมาธิมาพัฒนาความสัมพันธ์กับผู้อื่นได้",
        "Course Description": "ความหมายของการทำสมาธิ จุดประสงค์ วิธีการ ขั้นตอน จุดเริ่มต้นของการทำสมาธิ ลักษณะของการบริกรรมและการทำสมาธิ ประโยชน์ของสมาธิ ลักษณะอาการต่อต้านสมาธิ และการนำสมาธิไปใช้ในชีวิตประจำวัน สมาธิกับการเรียนและการงาน ลักษณะ ขั้นตอน คุณสมบัติ ประโยชน์ของฌานและญาณ สิ่งที่ควรรู้เรื่องวิปัสสนา ความแตกต่างระหว่างสมถะกับวิปัสสนา แผนผังสมถะกับวิปัสสนา ชาวโลกกับวิปัสสนา",
        "CurriculumWebsite": "https:\/\/sh.mahidol.ac.th\/?page_id=2176"
    },
    {
        "Id": 16,
        "Course Code ": "SIID 177",
        "Title": "นวัตกรรมด้านวิทยาศาสตร์สุขภาพเบื้องต้น",
        "Faculty\/\nInstitution\/College": "คณะแพทยศาสตร์ศิริราชพยาบาล",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "หมวดวิชาศึกษาทั่วไป",
        "Literacy Type": "Health Literacy  (Health, Sport)",
        "Latest Revision of the Course Specifications": "วันที่ ๖ สิงหาคม ๒๕๖๓ ",
        "Course Goals": "รายวิชานี้ มีจุดมุ่งหมายเพื่อพัฒนาผู้เรียนให้มีความรู้ ความเข้าใจ หลักการในการใช้นวัตกรรมด้านสุขภาวะต่าง ๆ มีความสามารถในการเลือกใช้นวัตกรรมเพื่อพัฒนาความรู้ทางสุขภาวะ และสามารถเลือกแนวทางในการพัฒนานวัตกรรมด้านสุขภาวะบนหลักการของความสมเหตุสมผล",
        "Course Objectives": "๑. ระบุหลักการในการใช้นวัตกรรมด้านสุขภาวะแบบต่าง ๆ ได้\n๒. เลือกใช้นวัตกรรมเพื่อพัฒนาความรู้ทางสุขภาวะบนพื้นฐานของจริยธรรมทางวิชาการ\n๓. พัฒนาทักษะการทำงานเป็นกลุ่มเพื่อหาข้อสรุปและแนวทางด้านวิชาการร่วมกัน\n๔. ใช้เทคโนโลยีในการสื่อสารและรวบรวมข้อมูลเกี่ยวกับนวัตกรรมด้านสุขภาวะ",
        "Course Description": "ความหมายนวัตกรรมด้านสุขภาวะ แบบจำลองและสถานการณ์จำลองด้านด้านสุขภาวะ ความเป็นจริงเสริมด้านสุขภาวะ ความเป็นจริงเสมือนด้านด้านสุขภาวะ เกมดิจิทัลด้านด้านสุขภาวะ",
        "CurriculumWebsite": "https:\/\/www.si.mahidol.ac.th\/th\/"
    },
    {
        "Id": 17,
        "Course Code ": "SIID 275",
        "Title": "วิทยาศาสตร์สุขภาพสำหรับการวิ่งมาราธอน",
        "Faculty\/\nInstitution\/College": "คณะแพทยศาสตร์ศิริราชพยาบาล",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "หมวดวิชาศึกษาทั่วไป และเลือกเสรี",
        "Literacy Type": "Health Literacy  (Health, Sport)",
        "Latest Revision of the Course Specifications": "วันที่ ๑๔ สิงหาคม ๒๕๖๒ ",
        "Course Goals": "รายวิชานี้ มีจุดมุ่งหมายเพื่อพัฒนาผู้เรียนให้มีความรู้ ความเข้าใจ หลักการวิทยาศาสตร์สุขภาพเพื่อการออกกำลังกาย ผ่านการเล่นกีฬาวิ่งมาราธอน (Marathon running) ที่มีทั้งผลกระทบด้านบวกและด้านลบ โดยสามารถนำไปประยุกต์เพื่อส่งเสริมศักยภาพในด้านสมรรถภาพทางกายและใจ  ที่เน้นกระบวนการฝึกความอดทน รวมทั้งให้เกิดการพัฒนาตนเองให้มีความมุ่งมั่น เป็นผู้ที่มีน้ำใจเป็นนักกีฬา และสามารถปรับตัวในสถานการณ์อื่นได้เมื่อต้องการกระทำสิ่งใดให้บรรลุจุดมุ่งหมายสูงสุด",
        "Course Objectives": "๑. เข้าใจหลักการวิทยาศาสตร์สุขภาพเพื่อการออกกำลังกายและกฎกติกาพื้นฐาน\nรวมถึงกติกาเฉพาะของกีฬาวิ่งมาราธอนและปฏิบัติตามได้อย่างถูกต้อง \n๒. เข้าใจการดูแลป้องกันและบำบัดอาการบาดเจ็บเบื้องต้นด้วยตนเองได้\n๓. เข้าใจและตระหนักรู้ถึงโรคที่เกิดจากการวิ่งมาราธอน \n๔. พัฒนาทักษะการวิ่งได้จนจบอย่างน้อยระยะครึ่งมาราธอน\n(อธิบายเพิ่มเติม..ระยะครึ่งมาราธอนเท่ากับ 21.0975 กม. \/ ระยะมาราธอนเท่ากับ 42.195 กม.)",
        "Course Description": "ความสำคัญของวิทยาศาสตร์สุขภาพกับการออกกำลังกาย การวิ่งมาราธอน กติกาพื้นฐาน ประเภทและระยะทางการวิ่ง มารยาทของนักกีฬา การปฐมพยาบาลอาการบาดเจ็บจากการวิ่ง  อาการและโรคที่เกิดจากการวิ่ง อุปกรณ์การวิ่ง การวิ่งที่บรรลุเป้าหมาย",
        "CurriculumWebsite": "https:\/\/www.si.mahidol.ac.th\/th\/"
    },
    {
        "Id": 18,
        "Course Code ": "SPGE 137",
        "Title": "แบดมินตันเพื่อสุขภาพ",
        "Faculty\/\nInstitution\/College": "วิทยาลัยวิทยาศาสตร์และเทคโนโลยีการกีฬา",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "หมวดวิชาศึกษาทั่วไป และเลือกเสรี",
        "Literacy Type": "Health Literacy  (Health, Sport)",
        "Latest Revision of the Course Specifications": "-",
        "Course Goals": "นักศึกษามีความรู้ความเข้าใจในกีฬาแบดมินตัน และสามารถใช้ประโยชน์จากการเล่นกีฬาแบดมินตัน เพื่อนันทนาการและพัฒนาสุขภาพองค์รวม",
        "Course Objectives": "๑. นักศึกษามีความรู้ ความเข้าใจเกี่ยวกับกีฬาแบดมินตัน\n๒. นักศึกษามีทักษะพื้นฐานกีฬาแบดมินตันที่ถูกต้องและปลอดภัย \n๓. สามารถสืบค้นข้อมูลเกี่ยวกับกีฬาแบดมินตันโดยใช้เทคโนโลยีสารสนเทศที่ถูกต้องและเชื่อถือได้\n๔. สามารถสื่อสารแลกเปลี่ยนเรียนรู้ข้อมูลสุขภาพเกี่ยวกับกีฬาแบดมินตัน เช่นการชมการแข่งขัน           \n การเตรียมตัวก่อนการเล่น",
        "Course Description": "ประโยชน์ กติกา มารยาท การแต่งกาย ความปลอดภัย ทักษะพื้นฐานในการเล่น เช่น การเคลื่อนที่ การจับไม้ การตีลูกหน้ามือ หลังมือ การส่งลูก ลูกเซฟ ลูกหยอด ",
        "CurriculumWebsite": "https:\/\/ss.mahidol.ac.th\/th\/index.php\/th\/"
    },
    {
        "Id": 19,
        "Course Code ": "SPGE 161",
        "Title": "ลีลาศเพื่อสุขภาพ",
        "Faculty\/\nInstitution\/College": "วิทยาลัยวิทยาศาสตร์และเทคโนโลยีการกีฬา",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "หมวดวิชาศึกษาทั่วไป",
        "Literacy Type": "Health Literacy  (Health, Sport)",
        "Latest Revision of the Course Specifications": "วันที่ 14 มิถุนายน 2565",
        "Course Goals": "นักศึกษามีความรู้ความเข้าใจในการออกกำลังกายด้วยกิจกรรมลีลาศเพื่อสุขภาพ และสามารถใช้ประโยชน์จากการออกกำลังกาย เพื่อนันทนาการและพัฒนาสุขภาพองค์รวม",
        "Course Objectives": "๑. นักศึกษามีความรู้ ความเข้าใจเกี่ยวกับกิจกรรมลีลาศเพื่อสุขภาพ\n๒. นักศึกษามีทักษะพื้นฐานกิจกรรมลีลาศเพื่อสุขภาพ ที่ถูกต้องและปลอดภัย \n๓. สามารถสืบค้นข้อมูลเกี่ยวกับกิจกรรมลีลาศเพื่อสุขภาพโดยใช้เทคโนโลยีสารสนเทศที่ถูกต้องและเชื่อถือได้\n๔. สามารถสื่อสารแลกเปลี่ยนเรียนรู้ข้อมูลสุขภาพเกี่ยวกับกิจกรรมลีลาศเพื่อสุขภาพ เช่น รูปแบบ และ วิธีการต่าง ๆ ของกิจกรรมลีลาศเพื่อสุขภาพ",
        "Course Description": "ลีลาศเพื่อสุขภาพ เจตคติในการเรียน การฝึกซ้อม ทักษะพื้นฐานการฟังจังหวะและทักษะการเต้นลีลาศจังหวะบีกิน วอลซ์ คิวบัน-รุมบ้า ช่า ช่า ช่า กฎกติกามารยาท และความปลอดภัย ",
        "CurriculumWebsite": "https:\/\/ss.mahidol.ac.th\/th\/index.php\/th\/"
    },
    {
        "Id": 20,
        "Course Code ": "SPGE 162",
        "Title": "โยคะเพื่อสุขภาพ",
        "Faculty\/\nInstitution\/College": "วิทยาลัยวิทยาศาสตร์และเทคโนโลยีการกีฬา",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "หมวดวิชาศึกษาทั่วไป และเลือกเสรี",
        "Literacy Type": "Health Literacy  (Health, Sport)",
        "Latest Revision of the Course Specifications": "วันที่ 14 มิถุนายน 2565",
        "Course Goals": "นักศึกษามีความรู้ความเข้าใจในการออกกำลังกายด้วยกิจกรรมโยคะเพื่อสุขภาพ และสามารถใช้ประโยชน์จากการออกกำลังกาย เพื่อนันทนาการและพัฒนาสุขภาพองค์รวม",
        "Course Objectives": "๑. นักศึกษามีความรู้ ความเข้าใจเกี่ยวกับกิจกรรมโยคะเพื่อสุขภาพ\n๒. นักศึกษามีทักษะพื้นฐานกิจกรรมโยคะเพื่อสุขภาพที่ถูกต้องและปลอดภัย \n๓. สามารถสืบค้นข้อมูลเกี่ยวกับกิจกรรมโยคะเพื่อสุขภาพโดยใช้เทคโนโลยีสารสนเทศที่ถูกต้องและเชื่อถือได้\n๔. สามารถสื่อสารแลกเปลี่ยนเรียนรู้ข้อมูลสุขภาพเกี่ยวกับกิจกรรมโยคะเพื่อสุขภาพ เช่น รูปแบบ และ วิธีการต่าง ๆ ของกิจกรรมโยคะเพื่อสุขภาพ",
        "Course Description": "ความหมาย ความสำคัญและประโยชน์ของการฝึกโยคะ หลักการและขั้นตอนการฝึก ข้อควรปฏิบัติในการและมารยาทในการฝึก  การเตรียมความพร้อมของร่างกายและจิตใจ การฝึกอาสนะขั้นพื้นฐาน ปราณายามะขั้นพื้นฐาน และการผ่อนคลายอย่างลึก โยคะเพื่อสุขภาพในชีวิตประจำวัน โยคะบำบัด  การออกแบบท่าชุดการฝึกโยคะเพื่อสุขภาพ ",
        "CurriculumWebsite": "https:\/\/ss.mahidol.ac.th\/th\/index.php\/th\/"
    },
    {
        "Id": 21,
        "Course Code ": "SPGE 163",
        "Title": "ว่ายน้ำเพื่อสุขภาพ",
        "Faculty\/\nInstitution\/College": "วิทยาลัยวิทยาศาสตร์และเทคโนโลยีการกีฬา",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "หมวดวิชาศึกษาทั่วไป และเลือกเสรี",
        "Literacy Type": "Health Literacy  (Health, Sport)",
        "Latest Revision of the Course Specifications": "วันที่ 14 มิถุนายน 2565",
        "Course Goals": "นักศึกษามีความรู้ความเข้าใจในกิจกรรมว่ายน้ำและสามารถใช้ประโยชน์จากการว่ายน้ำเพื่อนันทนาการและพัฒนาสุขภาพองค์รวม",
        "Course Objectives": "๑. นักศึกษามีความรู้ ความเข้า หลักการ กฎระเบียบ มารยาท ความปลอดภัยและความสำคัญของกิจกรรมว่ายน้ำเพื่อเชื่อมโยงสุขภาพได้\n๒. นักศึกษามีทักษะพื้นฐานในกิจกรรมว่ายน้ำที่ถูกต้องและปลอดภัย \n๓. สามารถสืบค้นข้อมูลเกี่ยวกับกิจกรรมว่ายน้ำโดยใช้เทคโนโลยีสารสนเทศที่ถูกต้องและเชื่อถือได้\n๔. สามารถสื่อสารแลกเปลี่ยนเรียนรู้ข้อมูลสุขภาพเกี่ยวกับกิจกรรมว่ายน้ำ เช่น การชมการแข่งขัน การเตรียมตัวก่อนการว่ายน้ำ",
        "Course Description": "การว่ายน้ำเพื่อสุขภาพ พื้นฐานการเคลื่อไหวตามหลักชีวกลศาสตร์ ทักษะพื้นฐานในการว่ายน้ำ คือ การหายใจในน้ำ การลอยตัว การเลี้ยงตัว การว่ายท่าฟรีสไตล์ ท่ากรรเชียง ท่ากบ ความปลอดภัยและกฎระเบียบ กติกามารยาท ในสระว่ายน้ำ",
        "CurriculumWebsite": "https:\/\/ss.mahidol.ac.th\/th\/index.php\/th\/"
    },
    {
        "Id": 22,
        "Course Code ": "SPGE 164",
        "Title": "ศิลปะการต่อสู้ป้องกันตัวเพื่อสุขภาพ",
        "Faculty\/\nInstitution\/College": "วิทยาลัยวิทยาศาสตร์และเทคโนโลยีการกีฬา",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "หมวดวิชาศึกษาทั่วไป",
        "Literacy Type": "Health Literacy  (Health, Sport)",
        "Latest Revision of the Course Specifications": "15-Jun-65",
        "Course Goals": "นักศึกษามีความรู้ความเข้าใจในการออกกำลังกายด้วยกิจกรรมศิลปะการป้องกันตัวเพื่อสุขภาพและสามารถใช้ประโยชน์จากการออกกำลังกาย เพื่อนันทนาการและพัฒนาสุขภาพองค์รวม",
        "Course Objectives": "๑. นักศึกษามีความรู้ ความเข้าใจเกี่ยวกับกิจกรรมศิลปะการป้องกันตัว\n๒. นักศึกษามีทักษะพื้นฐานกิจกรรมศิลปะการป้องกันตัวเพื่อสุขภาพที่ถูกต้องและปลอดภัย \n๓. สามารถสืบค้นข้อมูลเกี่ยวกับกิจกรรมศิลปะการป้องกันตัวเพื่อสุขภาพโดยใช้เทคโนโลยีสารสนเทศที่ถูกต้องและ เชื่อถือได้\n๔. สามารถสื่อสารแลกเปลี่ยนเรียนรู้ข้อมูลสุขภาพเกี่ยวกับกิจกรรมศิลปะการป้องกันตัวเพื่อสุขภาพเช่น รูปแบบ และ วิธีการต่าง ๆ ของกิจกรรมศิลปะการป้องกันตัวเพื่อสุขภาพ",
        "Course Description": "กฎ ระเบียบ กติกา มารยาท ความปลอดภัย และเจตคติในการเรียน การฝึกซ้อมทักษะพื้นฐานของศิลปะ การใช้มีดสั้นในเชิงรุก และรับและการแก้ไขให้พ้นจากการถูกควบคุมตัวและสามารถนำไปใช้เพื่อส่งเสริมสุขภาพและนันทนาการ",
        "CurriculumWebsite": "https:\/\/ss.mahidol.ac.th\/th\/index.php\/th\/"
    },
    {
        "Id": 23,
        "Course Code ": "CFGE 101",
        "Title": "ออกแบบชีวิต",
        "Faculty\/\nInstitution\/College": "สถาบันแห่งชาติเพื่อการพัฒนาเด็กและครอบครัว",
        "Curriculum": "หลักสูตรระดับปริญญาตรี ปกติ  (ยกเว้นหลักสูตรนานาชาติ)",
        "CourseType": "หมวดวิชาศึกษาทั่วไป และเลือกเสรี",
        "Literacy Type": "Social and Humanity Literacy  (Social, Humanity, Law, Ethics, Arts)",
        "Latest Revision of the Course Specifications": "วันที่ ๑  เดือน กุมภาพันธ์ พ.ศ. ๒๕๖๒",
        "Course Goals": "1.\tรายวิชานี้มีจุดมุ่งหมายเพื่อส่งเสริมและพัฒนาให้นักศึกษามหาวิทยาลัยมหิดลมีความรู้ความเข้าใจ เกี่ยวกับชีวิต พัฒนาการมนุษย์ บทบาทครอบครัว และชีวิตในมิติของพัฒนาการ ปัญหา อุปสรรค และการ บริหารจัดการชีวิต ตั้งแต่วัยเด็ก วัยรุ่น จนถึงการสร้างครอบครัว นักศึกษาสามารถประยุกต์ใช้ความรู้สหวิทยาการ ทั้งปรัชญา วิทยาศาสตร์ สังคมศาสตร์ มนุษยศาสตร์ ในการวิเคราะห์ วางแผนและรับมือกับสถานการณ์ปัญหาสังคม  สามารถพัฒนาความรู้และปรับเปลี่ยนกระบวนการเรียนรู้ของตนเอง มีความเข้าใจ ตนเอง ตระหนักในคุณค่าของชีวิตและสามารถดําเนินชีวิตอยู่ในสังคมอย่างมีความหมาย \n2.\tรายวิชานี้ประยุกต์แนวทางการเรียนรู้สู่การเปลี่ยนแปลง (Transformative Learning) ในการ จัดการเรียนการสอน โดยจัดให้นักศึกษาจัดทําโครงงานเพื่อออกแบบและพัฒนาชีวิตตนเอง แลกเปลี่ยน เรียนรู้ระหว่างผู้เรียน ผู้สอน ผู้ปฏิบัติงานในภาครัฐหรือเอกชนที่ดูแล ป้องกัน และแก้ปัญหาด้านเด็กและ เยาวชน จากสหวิชาชีพที่มีองค์ความรู้ ประสบการณ์ และมุมมองที่หลากหลาย   และสามารถวิเคราะห์ สภาวะปัญหาของชีวิตในในช่วงของพัฒนาการวัยเด็ก วัยรุ่น จนถึงหน่วยครอบครัว  เพื่อได้รับประสบการณ์ ตรงจากการเรียนรู้  รายวิชานี้เน้นกระบวนการจัดการเรียนรู้ที่ผู้เรียนได้ลงมือกระทําและใช้กระบวนการคิด กับสิ่งที่ตนเองได้เรียนรู้ (Active Learning)   อาทิเช่น การอภิปรายกลุ่ม การจัดทําแผนที่ความคิด การระดม สมอง การสืบค้นข้อมูลผ่านเทคโนโลยีสารสนเทศและสื่อ การศึกษาดูงานในสถานที่เกี่ยวข้องกับการป้องกัน และแก้ไขปัญหาด้านเด็ก เยาวชน และครอบครัว สังเกตการณ์และเก็บข้อมูล  การวิเคราะห์กรณีศึกษา สะท้อนคิด (Reflection) และการสรุปการเรียนรู้ร่วมกัน \n3.\tรายวิชามุ่งส่งเสริมให้บัณฑิตพัฒนาความรู้แจ้ง รู้จริง ทั้งด้านกว้างและลึก (T-shaped breadth & depth) ตามคุณลักษณะบัณฑิตมหาวิทยาลัยมหิดล (MU-Graduate Attributes) คือพัฒนาความรู้ที่เกี่ยวข้อง กับวิชาชีพ พัฒนาทักษะการเรียนรู้ การใช้สื่อและเทคโนโลยี และทักษะชีวิตของตนเอง รวมถึงส่งเสริมให้ให้ บัณฑิตพัฒนาสมรรถนะหลัก (MU Graduates Core Competencies) ทางด้านสติปัญญา (Cognitive Domain) สมรรถนะระหว่างบุคคล (Interpersonal Domain)  และสมรรถนะภายในตัวบุคคล (Intrapersonal Domain) เพื่อให้มีความพร้อมในการดําเนินชีวิตและการทํางานในอนาคต    ",
        "Course Objectives": "1.\tผู้เรียนมีความรู้ความเข้าใจเกี่ยวกับความหมาย องค์ประกอบ และคุณค่าของชีวิต ทั้งในแง่มุมเชิงปรัชญา วิทยาศาสตร์ และสังคมศาสตร์ เพื่อการพัฒนามนุษย์ได้อย่างถูกต้อง และมีความรู้ ความ เข้าใจถึงสภาวะปัญหาของชีวิต ตั้งแต่พัฒนาการตั้งแต่วัย เด็ก วัยรุ่น จนถึงระดับครอบครัว \n2.\tผู้เรียนสามารถนําความรู้ไปใช้ในการวิเคราะห์ วางแผนและรับมือกับสถานการณ์ปัญหาสังคม และถ่ายทอดความรู้สู่สังคม \n3.\tผู้เรียนสามารถออกแบบและพัฒนาชีวิตตนเองเพื่อสุขภาวะที่ดี",
        "Course Description": "ปรัชญาและความหมายของชีวิต  เป้าหมายและการวางแผนชีวิต  บทบาทของครอบครัว ความปลอดภัย ในชีวิต  เสวนาชีวิต  การออกแบบชีวิตมิติโลกกายภาพ  ภูมิคุ้มกันและนวตกรรมชีวิต  การออกแบบชีวิตมิติโลก เสมือนจริง  สถาปัตยกรรมสมอง  ผู้ประกอบการชีวิต  วิพากษ์ชีวิต  พลังความคิดบวก การนําเสนอโครงงานของ นักศึกษา ",
        "CurriculumWebsite": "https:\/\/cf.mahidol.ac.th\/th\/หลักสูตรปริญญาตรี\/"
    },
    {
        "Id": 24,
        "Course Code ": "EGID 103",
        "Title": "เทคโนโลยีและแนวโน้มสาหรับการบริบาลสุขภาพในอนาคต",
        "Faculty\/\nInstitution\/College": "คณะวิศวกรรมศาสตร์",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "หมวดวิชาศึกษาทั่วไป",
        "Literacy Type": "Digital Literacy (ICT, Applied Mathematics) ",
        "Latest Revision of the Course Specifications": "วันที่ ๕ เดือน ตุลาคม พ.ศ. ๒๕๖๒",
        "Course Goals": "เมื่อสิ้นสุดการเรียนการสอนแล้ว นักศึกษามีความรู้เกี่ยวกับองค์ประกอบของเทคโนโลยีสารสนเทศ บทบาทของเทคโนโลยีสารสนเทศในสังคมสมัยใหม่ เข้าใจในเรื่องความปลอดภัยและความเสี่ยงของการใช้เทคโนโลยีสารสนเทศ และสามารถนำความรู้เกี่ยวกับเทคโนโลยีสารสนเทศไปใช้ในชีวิตประจำวันได้",
        "Course Objectives": "เมื่อสิ้นสุดการเรียนการสอนแล้ว นักศึกษาที่สำเร็จการศึกษาในรายวิชา สามารถ  ๑. นักศึกษาสามารถอธิบายองค์ประกอบและโครงสร้างพื้นฐานของเทคโนโลยีสารสนเทศ ๒. รู้บทบาทของเทคโนโลยีสารสนเทศในสังคมสมัยใหม่ ๓. เข้าใจในเรื่องความปลอดภัยและความเสี่ยงของ การใช้เทคโนโลยีสารสนเทศในชีวิตประจำวัน ๔. นำความรู้เกี่ยวกับเทคโนโลยีสารสนเทศไปใช้ประโยชน์ได้",
        "Course Description": "แนะนำคอมพิวเตอร์และเทคโนโลยีสารสนเทศ บทบาทของเทคโนโลยีสารสนเทศในสังคมสมัยใหม่ โครงสร้างพื้นฐานของเทคโนโลยีสารสนเทศ คอมพิวเตอร์ฮาร์ดแวร์ ซอฟต์แวร์ และเทคโนโลยีการสื่อสาร ระบบฐานข้อมูลและคลังข้อมูล ระบบสนับสนุนการตัดสินใจและปัญญาประดิษฐ์ พาณิชย์อิเล็กทรอนิกส์ การรักษาความปลอดภัยคอมพิวเตอร์ อาชญากรรมทางคอมพิวเตอร์ และการสืบสวนเชิงเลข",
        "CurriculumWebsite": "https:\/\/rs.mahidol.ac.th\/academic\/egco\/egco342.html"
    },
    {
        "Id": 25,
        "Course Code ": "LAEN 266",
        "Title": "ภาษาอังกฤษเพื่อวิทยาศาสตร์สุขภาพ",
        "Faculty\/\nInstitution\/College": "คณะศิลปศาสตร์",
        "Curriculum": "หลักสูตรระดับปริญญาตรี ปกติ  (ยกเว้นหลักสูตรนานาชาติ)",
        "CourseType": "หมวดวิชาศึกษาทั่วไป และกลุ่มวิชาภาษา",
        "Literacy Type": "Communication Literacy (language, Academic Communication)",
        "Latest Revision of the Course Specifications": "วันที่ ๒๖ เดือน กุมภาพันธ์ พ.ศ. ๒๕๖๒",
        "Course Goals": "รายวิชานี้มีจุดมุ่งหมายเพื่อพัฒนาคุณลักษณะบัณฑิตที่พึงประสงค์ของมหาวิทยาลัยมหิดล ในด้าน Globally Talented กล่าวคือนักศึกษาจะได้เรียนรู้และปฏิบัติทักษะการฟัง พูด อ่าน และเขียนภาษาอังกฤษในบริบท วิทยาศาสตร์สุขภาพที่เกี่ยวของกับความเปลี่ยนแปลงและความก้าวหน้าทางวิทยาศาสตร์ และเทคโนโลยีของ สังคมไทยและสังคมโลก ตลอดจนการทําความเข้าใจกับบทบาทหน้าที่และความรับผิดชอบต่อตนเองและต่อผู้อื่น ผ่านกิจกรรมและการทํางานเป็นกลุ่ม  ",
        "Course Objectives": "รายวิชานี้มีวัตถุประสงคเพื่อจัดประสบการณการเรียนรู้ให้นักศึกษาใช้คําศัพท์ สํานวน และโครงสร้าง ภาษาอังกฤษที่เกี่ยวของกับวิทยาศาสตรสุขภาพ ผ่านการฝึกปฏิบัติ การระดมสมอง การเล่นเกม และการทํางานกลุ่ม อันเป็นการส่งเสริมทักษะการสื่อสารทั้ง ฟัง พูด อ่าน และเขียนภาษาอังกฤษ ตลอดจนการตระหนักถึงบทบาทหน้าที่ และความรับผิดชอบในการทํางานกลุ่ม ",
        "Course Description": "การศึกษาคํารูปประโยคและสํานวนที่ใช้ในวิชาชีพเกี่ยวกับวิทยาศาสตร์สุขภาพโดยการฝึกฝนเชิงสื่อสารใน  ทักษะการพูด ฟัง อ่าน และเขียน ",
        "CurriculumWebsite": "https:\/\/la.mahidol.ac.th\/education\/page_id2113-7\/"
    },
    {
        "Id": 26,
        "Course Code ": "LAEN 272",
        "Title": "ภาษาอังกฤษสำหรับบุคลากรทางการแพทย์",
        "Faculty\/\nInstitution\/College": "คณะศิลปศาสตร์",
        "Curriculum": "หลักสูตรระดับปริญญาตรี ปกติ  (ยกเว้นหลักสูตรนานาชาติ)",
        "CourseType": "วิชาศึกษาทั่วไป กลุ่มวิชาภาษา และวิชาเลือกเสรี",
        "Literacy Type": "Communication Literacy (language, Academic Communication)",
        "Latest Revision of the Course Specifications": "วันที่ ๒๖ เดือน กุมภาพันธ์ พ.ศ. ๒๕๖๒",
        "Course Goals": "รายวิชานี้มีจุดมุ่งหมายเพื่อพัฒนาคุณลักษณะบัณฑิตที่พึงประสงค์ของมหาวิทยาลัยมหิดลในด้าน Globally Talented กล่าวคือ นักศึกษาจะได้เรียนรู้และฝึกปฏิบัติการใช้ภาษาอังกฤษเพื่อการสื่อสารในบริบททั่วไปทางการแพทย์อัน จะส่งผลให้นักศึกษามีความสามารถในการแข่งขันในระดับสากลได้",
        "Course Objectives": "๑. เพื่อเสริมสร้างความรู้และทักษะในการใช้ภาษาอังกฤษเพื่อการสื่อสารในบริบททั่วไปทางการแพทย์\n๒. เพื่อส่งเสริมให้นักศึกษาตระหนักถึงความสำคัญของการทำงานเป็นกลุ่ม และมีความรับผิดชอบต่อตนเองและผู้อื่น",
        "Course Description": "คําศัพท์ สํานวนและข้อมูลเกี่ยวกับการแพทย์ การฝึกปฏิบัติการพูดสื่อสารในสถานการณ์จริง การฟัง การอ่าน และการสรุปความจากการอ่านและฟังในปริบทต่าง ๆ ที่เกี่ยวของกับการแพทย์",
        "CurriculumWebsite": "https:\/\/la.mahidol.ac.th\/education\/page_id2113-7\/"
    },
    {
        "Id": 27,
        "Course Code ": "LAEN 275",
        "Title": "ภาษาอังกฤษสำหรับการพยาบาล",
        "Faculty\/\nInstitution\/College": "คณะศิลปศาสตร์",
        "Curriculum": "หลักสูตรระดับปริญญาตรี ปกติ  (ยกเว้นหลักสูตรนานาชาติ)",
        "CourseType": "วิชาศึกษาทั่วไป กลุ่มวิชาภาษา และวิชาเลือกเสรี",
        "Literacy Type": "Communication Literacy (language, Academic Communication)",
        "Latest Revision of the Course Specifications": "วันที่ ๒๖ เดือน กุมภาพันธ์ พ.ศ. ๒๕๖๒",
        "Course Goals": "เพื่อเพิ่มพูนทักษะภาษาอังกฤษเชิงวิชาการและการสื่อสารด้านการพยาบาล ซึ่งมีความเกี่ยวของกับองค์ความรู้\nพื้นฐานทางวิทยาศาสตร์การแพทย์และเพื่อปรับปรุงเนื้อหารายวิชาให้เชื่อมโยงกับวิชาอื่นๆ และให้ทันต่อการเปลี่ยนแปลง\nและความก้าวหน้าของวิทยาศาสตร์เทคโนโลยี ความหลากหลายของช่องทางในการติดต่อสื่อสาร การเปลี่ยนแปลงของ\nสังคมไทยและสังคมโลก รวมทั้งให้ตระหนักในคุณค่าและมีเจตคติที่ดีต่อการอ่านในด้านการวิเคราะห์ วิจารณ์ การประเมิน\nซึ่งจะเป็นเครื่องมือในการแสวงหาความรู้เพื่อพัฒนาตนเองตลอดชีวิต",
        "Course Objectives": "รายวิชานี้มุ่งพัฒนานักศึกษาให้มีความรู้และทักษะภาษาอังกฤษเพื่อการสื่อสารในบริบทของการพยาบาลและการ\nทำงานร่วมกับผู้อื่นเป็นกลุ่มโดยเน้นการฝึกปฏิบัติ การทำกิจกรรมกลุ่ม และการมอบหมายงาน",
        "Course Description": "ศึกษาคำศัพท์ สำนวนและข้อมูลเกี่ยวกับการพยาบาล การฝึกปฏิบัติการพูดสื่อสารในสถานการณ์จริง การ\nฟัง การอ่าน และการสรุปความทางด้านการพยาบาล",
        "CurriculumWebsite": "https:\/\/la.mahidol.ac.th\/education\/page_id2113-7\/"
    },
    {
        "Id": 28,
        "Course Code ": "LAFE 147",
        "Title": "จิตวิทยาเพื่อคุณภาพชีวิต",
        "Faculty\/\nInstitution\/College": "คณะศิลปศาสตร์",
        "Curriculum": "หลักสูตรระดับปริญญาตรี ปกติ  (ยกเว้นหลักสูตรนานาชาติ)",
        "CourseType": "วิชาศึกษาทั่วไป กลุ่มวิชาสังคมศาสตร์ มนุษยศาสตร์ และวิชาเลือกเสรี",
        "Literacy Type": "Social and Humanity Literacy (Social, Humanity, Law, Ethics, Arts)",
        "Latest Revision of the Course Specifications": "วันที่ ๒๕ เดือน กุมภาพันธ์ พ.ศ. ๒๕๖๒",
        "Course Goals": "เพื่อพัฒนานักศึกษาให้มีคุณลักษณะบัณฑิตที่พึงประสงค์ตามที่มหาวิทยาลัยมหิดลกําหนด ในด้าน T-Shaped breadth & depth และ Entrepreneurially Minded กล่าวคือ นักศึกษาจะได้เรียนรู้เกี่ยวกับจิตวิทยา และการพัฒนาคุณภาพชีวิต และ เข้าใจหลักการ ผ่านการบรรยายและอภิปรายแลกเปลี่ยนความคิดเห็นระหว่างนักศึกษากับผู้สอน  ตลอดจน การวิเคราะห์ กรณีศึกษาและการประยุกต์หลักการเพื่อเสนอแนวทางและวางแผนการพัฒนาตนเอง การเตรียมตนเองเพื่อเข้าสู่อาชีพ  การสร้าง ความสัมพันธ์และการทํางานร่วมกับผู้อื่น อีกทั้งยังเป็นการส่งเสริมให้นักศึกษากล้าคิด กล้าตัดสินใจในเชิงสร้างสรรค์  ",
        "Course Objectives": "     ๑.  จัดประสบการณ์การเรียนรู้ ให้นักศึกษาสามารถประยุกต์ใช้ความรู้จิตวิทยาในการวางแผนพัฒนาคุณภาพชีวิต ตนเอง และเตรียมตนเองเข้าสู่อาชีพ \n     ๒.  ให้นักศึกษาเรียนรู้และตระหนักถึงบทบาทของตนเองในการทํางานร่วมกับผู้อื่น  มีความรับผิดชอบ มีความคิด สร้างสรรค์ และปฏิบัติตนตามกฎระเบียบกติกาของสังคม ",
        "Course Description": "การเรียนรู้เกี่ยวกับการพัฒนาการของมนุษย์ การปรับตัว การเข้าใจตนเอง และผู้อื่น อิทธิพลทางสังคม และสิ่งแวดล้อมที่ มีผลต่อการดําเนินชีวิต การมีสุขภาพจิตที่ดี การวางแผนชีวิต ความคิดริเริ่มสร้างสรรค์ ความรับผิดชอบต่อตนเอง ครอบครัว และ สังคม ",
        "CurriculumWebsite": "https:\/\/la.mahidol.ac.th\/education\/page_id2113-7\/"
    },
    {
        "Id": 29,
        "Course Code ": "LALA 274",
        "Title": "ปรัชญาความรัก",
        "Faculty\/\nInstitution\/College": "คณะศิลปศาสตร์",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "หมวดวิชาศึกษาทั่วไป และเลือกเสรี",
        "Literacy Type": "Social and Humanity Literacy (Social, Humanity, Law, Ethics, Arts)",
        "Latest Revision of the Course Specifications": "วันที่ ๒๕ เดือน กุมภาพันธ์ พ.ศ. ๒๕๖๒",
        "Course Goals": "เพื่อให้นักศึกษาได้เรียนรู้เกี่ยวกับแนวคิดพื้นฐานของปรัชญาความรัก ความหมายและประเภทของความรัก ค ว าม รั ก ใน ท ร รศ น ะ ข อ ง Socrates, Plato, Aristotle, Rousseau, Sartre, Simone de Beauvoir แ ล ะ Freud ความรักกับจริยธรรม ปัญหาเกี่ยวกับความรัก ความรักอุดมคติ ความรักตามหลักพระพุทธศาสนาและศาสนาคริสต เพื่อจะได้รู้จักรับผิดชอบต่อตนเองและส่วนรวม เพื่อประโยชน์ต่อตนเองและสังคมโดยรวมอย่างยั่งยืน ",
        "Course Objectives": "  ๑. พัฒนาความรู้และความเข้าใจในทฤษฎีต่างๆ ทางปรัชญาความรัก  \n  ๒. เพื่อให้นักศึกษาได้เรียนรู้ประเด็นปัญหาเบื้องต้นของปรัชญาความรักในปัจจุบัน  \n ๓. เพื่อให้นักศึกษาสามารถนําแนวคิดทางปรัชญาความรักที่ได้เรียนรู้ไปประยุกตใช้ในชีวิตจริง  ๔. เพื่อให้นักศึกษาเรียนรู้การใช้เหตุผลทางปรัชญา ในการอธิบายเหตุการณต่างๆ ที่เกิดขึ้นในชีวิต ",
        "Course Description": "แนวคิดพื้นฐานของปรัชญาความรัก ความหมายและประเภทของความรัก ความรักในทรรศนะของ โสเครตีส  เพลโต  อริสโตเติล  รุสโซ  ซารต  ซีมอน เดอ โบวัวร  และฟรอยด ความรักกับจริยธรรม ปัญหาเกี่ยวกับความ รัก ความรักอุดมคติ ความรักตามหลักพระพุทธศาสนาและศาสนาคริสต์ ",
        "CurriculumWebsite": "https:\/\/la.mahidol.ac.th\/education\/page_id2113-7\/"
    },
    {
        "Id": 30,
        "Course Code ": "PYGE 101 ",
        "Title": "สมุนไพรในชีวิตประจำวัน",
        "Faculty\/\nInstitution\/College": "คณะเภสัชศาสตร์",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "หมวดวิชาศึกษาทั่วไป",
        "Literacy Type": "Science and Environmental Literacy (Applied Science for Life, Environmental Responsibility)",
        "Latest Revision of the Course Specifications": "วันที่ ๑ เดือน กรกฎาคม พ.ศ. ๒๕๖๔",
        "Course Goals": "นักศึกษารู้จักหลักพฤกษศาสตร์เบื้องต้น การเลือกอาหารและเครื่องสาอางสมุนไพรเพื่อใช้ในชีวิตประจาวัน สมุนไพรสาธารณสุขมูลฐาน ยาสามัญประจาบ้านแผนโบราณ และผลิตภัณฑ์จากสมุนไพรที่พบบ่อยในร้านขายยา วิธีการเลือกใช้สมุนไพร ผลิตภัณฑ์สุขภาพจากสมุนไพร และยาสมุนไพร ที่ปลอดภัยและมีคุณภาพในการดูแลสุขภาพเบื้องต้น การเตรียมผลิตภัณฑ์สมุนไพรอย่างง่าย",
        "Course Objectives": "๑. มีความรู้เรื่องหลักพฤกษศาสตร์เบื้องต้น สมุนไพรและผลิตภัณฑ์จากสมุนไพรที่พบบ่อยในชีวิตประจาวัน\n๒. สามารถใช้ประโยชน์จากสมุนไพรและผลิตภัณฑ์สุขภาพจากสมุนไพรในการดูแลสุขภาพเบื้องต้น\n๓. สามารถค้นคว้าข้อมูลและนาเสนอผลงานโดยเลือกใช้เทคโนโลยีสารสนเทศได้อย่างเหมาะสม\n๔. มีทักษะในการทางานร่วมกับผู้อื่น และมีความรับผิดชอบต่องานที่ได้รับมอบหมาย",
        "Course Description": "หลักพฤกษศาสตร์เบื้องต้น อาหารและเครื่องสาอางสมุนไพรในชีวิตประจาวัน สมุนไพรสาธารณสุขมูลฐาน ยาสามัญประจาบ้านแผนโบราณ และผลิตภัณฑ์จากสมุนไพรที่พบบ่อยในร้านขายยา วิธีการเลือกใช้สมุนไพร ผลิตภัณฑ์สุขภาพจากสมุนไพร และยาสมุนไพร ที่ปลอดภัยและมีคุณภาพในการดูแลสุขภาพเบื้องต้น การเตรียมผลิตภัณฑ์สมุนไพรอย่างง่าย",
        "CurriculumWebsite": "https:\/\/pharmacy.mahidol.ac.th\/th\/study-undergrad.php"
    },
    {
        "Id": 31,
        "Course Code ": "SCGE 180",
        "Title": "รู้ทันวิทยาศาสตร์สุขภาพในสื่อ",
        "Faculty\/\nInstitution\/College": "คณะวิทยาศาสตร์",
        "Curriculum": "หลักสูตรระดับปริญญาตรี ปกติ  (ยกเว้นหลักสูตรนานาชาติ)",
        "CourseType": "หมวดวิชาศึกษาทั่วไป",
        "Literacy Type": "Health Literacy  (Health, Sport) ",
        "Latest Revision of the Course Specifications": "วันที่ ๑๒ เดือน ธันวาคม  พ.ศ. ๒๕๖๑",
        "Course Goals": "รายวิชานี้มุ่งพัฒนาทักษะการค้นคว้าข้อมูล การทำงานเป็นทีม การสื่อสารที่มีประสิทธิภาพ เพื่อให้นักศึกษาใช้สื่ออย่างรู้เท่าทัน สามารถวิเคราะห์ข้อมูล ข่าวสาร และคำโฆษณาที่จะผ่านเข้ามาในชีวิต ทั้งต่อตนเองและบุคคลใกล้ตัว เช่น ผู้ปกครอง และเพื่อน เพื่อไม่ให้นักศึกษาและบุคคลใกล้ตัว ได้รับอันตรายจากข้อมูล ข่าวสาร และคำโฆษณาที่เกี่ยวข้องกับสุขภาพ",
        "Course Objectives": "๑.\tได้เรียนรู้ขั้นตอนการวิเคราะห์ข้อมูล ข่าวสาร หรือคำโฆษณาที่นักศึกษาพบในสื่อสังคมออนไลน์ เพื่อนำไปสู่การวิเคราะห์ความเป็นไปได้ของข้อมูล ข่าวสาร หรือคำโฆษณานั้น ก่อนที่นักศึกษาจะส่งต่อข้อมูล\n๒.\tเกิดทักษะการคิดเชิงวิเคราะห์ เพื่อใช้ประเมินความเป็นไปได้ของข้อมูล ข่าวสาร หรือคำโฆษณาที่นักศึกษาจะพบในสื่อสังคมออนไลน์ต่อไปในอนาคต\n๓.\tฝึกการนำเสนอผลงานในรูปแบบสื่อสิ่งพิมพ์ ที่เข้าใจง่าย และมีสาระ โดยไม่ละเมิดลิขสิทธิ์ในรูปภาพหรือข้อความของที่มาของข้อมูล\n๔.\tเลือกใช้เทคโนโลยีสารสนเทศที่เหมาะสมมาช่วยสื่อสารผลงาน เพื่อให้สาระความรู้ที่เข้าใจง่ายแก่ผู้รับฟัง\n๕.\tทำงานเป็นทีมอย่างมีประสิทธิภาพ",
        "Course Description": "ข่าวที่แชร์อย่างแพร่หลายในสื่อสังคมออนไลน์ โฆษณาอาหารเสริมสุขภาพ โฆษณายาสมุนไพร สารต้านอนุมูลอิสระในสินค้าอุปโภคบริโภค ผลิตภัณฑ์บำรุงผิว ศัลยกรรมตบแต่ง สเต็มเซลล์ในสินค้าอุปโภคบริโภค การออกกำลังกายเพื่อลดน้ำหนัก ยาลดน้ำหนัก การฝึกทักษะการคิดเชิงวิพากษ์ การฝึกทักษะการสืบค้นข้อมูลและทักษะด้านเทคโนโลยีสารสนเทศ เพื่อทำงานกลุ่มและนำเสนอในห้องเรียน กฎหมายที่เกี่ยวกับการแชร์สื่อสังคมออนไลน์",
        "CurriculumWebsite": "https:\/\/science.mahidol.ac.th\/undergraduate\/th_bachelor.php"
    },
    {
        "Id": 32,
        "Course Code ": "SHED 128",
        "Title": "การออกแบบนวัตกรรมการออกกำลังกาย",
        "Faculty\/\nInstitution\/College": "คณะสังคมศาสตร์และมนุษยศาสตร์",
        "Curriculum": "หลักสูตรปริญญาตรี  ",
        "CourseType": "หมวดวิชาศึกษาทั่วไป (สุขภาพและกีฬา)",
        "Literacy Type": "Health Literacy  (Health, Sport) ",
        "Latest Revision of the Course Specifications": "วันที่ ๒๘  ธันวาคม  พ.ศ. ๒๕๖๑",
        "Course Goals": "๑.๑  เพื่อส่งเสริมให้นักศึกษามีความรู้เกี่ยวกับนวัตกรรม นวัตกรรมการเรียนรู้ และการออกแบบนวัตกรรมการออกกำลังกาย\n๑.๒  เพื่อพัฒนาทัศนคติที่ดีเกี่ยวกับการออกกำลังกายและสร้างความฉลาดทางอารมณ์ให้แก่นักศึกษา\n๑.๓  เพื่อพัฒนาทักษะการคิดอย่างเป็นระบบและสร้างสรรค์\n๑.๔\t เพื่อฝึกทักษะทางสังคมในการทำงานร่วมกันร่วมกับผู้อื่น ความมีวินัย และความรับผิดชอบต่อสังคม",
        "Course Objectives": "๒.๑.๑  รู้และเข้าใจเกี่ยวกับนวัตกรรม นวัตกรรมการเรียนรู้ การออกแบบนวัตกรรมการออกกำลังกายด้วยตนเองในรูปแบบต่าง ๆ โดยใช้เครื่องมือและเทคนิคต่าง ๆ อย่างเหมาะสม\n๒.๑.๒  ตระหนักรู้ถึงความสำคัญของการออกกำลังกาย และมีความฉลาดทางอารมณ์ที่ส่งผลต่อการพัฒนาพฤติกรรมการออกกำลังกายที่เหมาะสมและการมีสุขภาวะที่ดี\n๒.๑.๓  กำหนดความต้องการ ออกแบบ และสร้างต้นแบบนวัตกรรมการออกกำลังกายโดยกระบวนการคิดอย่างเป็นระบบและสร้างสรรค์\n๒.๑.๔   มีทักษะทางสังคมในการทำงานร่วมกันเป็นทีม มีวินัยและความรับผิดชอบ เพื่อส่งเสริมการเป็นพลเมืองดีและรับผิดชอบต่อสังคม",
        "Course Description": "นวัตกรรม หลักการออกแบบนวัตกรรมการเรียนรู้ด้วยตนเอง การเรียนรู้ด้วยนวัตกรรม เทคนิคการสืบค้นและวิเคราะห์สารสนเทศเพื่อออกแบบนวัตกรรม เทคนิคการออกแบบนวัตกรรม เทคนิคการออกแบบนวัตกรรมแบบเล่นและเรียนรู้ การสร้างต้นแบบนวัตกรรม องค์ประกอบในการออกกำลังกาย คุณค่าของการออกกำลังกาย ความฉลาดทางอารณ์ พฤติกรรมการออกกำลังกายที่เหมาะสม และการมีสุขภาวะที่ดี รูปแบบและการออกแบบการออกกำลังกายอย่างสร้างสรรค์ การออกแบบต้นแบบนวัตกรรมการออกกำลังกาย",
        "CurriculumWebsite": "https:\/\/sh.mahidol.ac.th\/?page_id=2176"
    }
]